In [ ]:
pip install pymysql

In [3]:
import pandas as pd
import numpy as np
import env
np.random.seed(123)

In [7]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [8]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [9]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, url)
employees.head()

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

In [10]:
query = '''
SELECT
    t.title as title,
    d.dept_name as dept_name
FROM titles t
JOIN dept_emp USING (emp_no)
JOIN departments d USING (dept_no)
LIMIT 100
'''

title_dept = pd.read_sql(query, url)
title_dept.head()

          title         dept_name
0         Staff  Customer Service
1  Senior Staff  Customer Service
2         Staff  Customer Service
3  Senior Staff  Customer Service
4         Staff  Customer Service

In [11]:
title_dept = pd.read_sql(query, env.get_db_url(user, password, host, 'employees'))
title_dept.head()

          title         dept_name
0         Staff  Customer Service
1  Senior Staff  Customer Service
2         Staff  Customer Service
3  Senior Staff  Customer Service
4         Staff  Customer Service

In [12]:
pd.read_sql(query, env.get_db_url(user, password, host, 'employees'))

           title         dept_name
0          Staff  Customer Service
1   Senior Staff  Customer Service
2          Staff  Customer Service
3   Senior Staff  Customer Service
4          Staff  Customer Service
..           ...               ...
95  Senior Staff  Customer Service
96         Staff  Customer Service
97  Senior Staff  Customer Service
98  Senior Staff  Customer Service
99         Staff  Customer Service

[100 rows x 2 columns]

In [18]:
title_dept.shape

(100, 2)